import { breakLine } from "./index";

[
  {
    str: "零二三四五六七八九十一二三四五六七八九十二二三四五六七八九十",
    expect: "零二三四五六七八九十\n一二三四五六七八九十\n二二三四五六七八九十",
  },
  {
    str: "零二三四五",
    expect: "零二三四五",
  },
  {
    str: "零二三四五六七八九十一二三四五六七八九十二二三四五六七八九十三二三四五六七八九十",
    expect: "零二三四五六七八九十\n一二三四五六七八九十\n二二三四五六七八九十",
  },
  {
    str: "零二三四五六七！九十一二三四五六七八九十二二三四五六七八九十",
    expect: "零二三四五六七！九十\n一二三四五六七八九十\n二二三四五六七八九十",
  },
  {
    str: "零二三四五六七！九十一二三四五六七八九十二二三四五六七八",
    expect: "零二三四五六七！\n九十一二三四五六七八\n九十二二三四五六七八",
  },
  {
    str: "零二三四五六七【九十一二三四五六七八九】二二三四五六七八",
    expect: "零二三四五六七【九十\n一二三四五六七八九】\n二二三四五六七八",
  },
  {
    str: "零二三四五六七【九十一二三四五六七八九】二二三四五六七",
    expect: "零二三四五六七\n【九十一二三四五六七\n八九】二二三四五六七",
  },
  {
    str: "零二三四五六七八九a一二三四五六七八九十二二三四五六七八九十b",
    expect: "零二三四五六七八九a\n一二三四五六七八九十\n二二三四五六七八九十",
  },
  {
    str: "零二三四五六七八九十一二三四五六、八九十二二三四五六七八九十",
    expect: "零二三四五六七八九十\n一二三四五六、八九十\n二二三四五六七八九十",
  },
  {
    str: "零二三四五六七八九十一二三四五六、八九十二二三四五六七",
    expect: "零二三四五六七八九十\n一二三四五六、\n八九十二二三四五六七",
  },
  {
    str: "零二三四五六七八九十一二三四五六七八九十二二三四五。七八九十",
    expect: "零二三四五六七八九十\n一二三四五六七八九十\n二二三四五。七八九十",
  },
].forEach((dat) => {
  if (breakLine(dat.str, 10, 3) != dat.expect) {
    console.log("Test failed.", dat);
  }
});
console.log("Test finished.");
